{
    "cryptobex": {
      "title": "Cryptobex Gizlilik Politikası",
      "effectiveDate": "Yürürlük Tarihi: 7.02.2025",
      "section1Title": "1. Giriş",
      "section1Text": "Cryptobex, kullanıcıların sanal para ile denemeler yapabileceği ve risksiz bir ortamda oyun stratejileri geliştirebileceği stratejik simülasyon oyunu uygulamasıdır. Kullanıcılar, Google OAuth kimlik bilgilerini kullanarak giriş yapar; ardından oturumları güvenli bir şekilde yönetmek için bir JWT token oluşturulur.",
      "section2Title": "2. Topladığımız Bilgiler",
      "section2Text": "Cryptobex aşağıdaki verileri toplamaktadır:",
      "section2ListItem1": "<1>Kimlik Doğrulama Verileri:</1> Google OAuth aracılığıyla sağlanan, Gmail adresiniz, adınız ve profil detaylarınızı içeren bilgiler. Kimlik doğrulamasının ardından, oturum yönetimi için bir JWT token oluşturulur.",
      "section2ListItem2": "<1>Kullanım Verileri:</1> Cihaz tipi, IP adresi, tarayıcı bilgileri, etkileşim günlükleri ve oyun içi eylemler gibi teknik ayrıntılar.",
      "section3Title": "3. Bilgilerinizi Nasıl Kullanıyoruz",
      "section3Text": "Verilerinizi şu amaçlarla kullanıyoruz:",
      "section3ListItem1": "Google OAuth aracılığıyla hesabınızı doğrulamak ve güvence altına almak, oturumunuzu JWT tokenları ile yönetmek.",
      "section3ListItem2": "Etkileşimlerinize dayalı olarak stratejiler ve öneriler geliştirerek oyun deneyiminizi kişiselleştirmek ve geliştirmek.",
      "section3ListItem3": "Uygulama performansını artırmak, sorunları tespit etmek ve yeni özellikler geliştirmek.",
      "section4Title": "4. Google OAuth ve JWT",
      "section4Text": "Güvenli, tek tıklamayla giriş deneyimi sunmak için Google OAuth kullanıyoruz. Başarılı bir kimlik doğrulamasının ardından, bir JWT token oluşturulur ve güvenli bir şekilde saklanır. Token ile ilgili tüm iletişim, şifrelenmiş kanallar üzerinden gerçekleştirilir.",
      "section5Title": "5. Veri Güvenliği",
      "section5Text": "Verileriniz, aktarım sırasında şifrelemenin sağlanması için HTTPS kullanılarak iletilir. Gmail adresleri ve adlar da dahil olmak üzere tüm kişisel bilgiler, şifrelenmiş veritabanlarımızda güvenli bir şekilde saklanır. Verilerinize erişim, yalnızca yetkili personel ile sınırlı ve sıkı bir şekilde kontrol edilmektedir.",
      "section6Title": "6. Çocukların Gizliliği",
      "section6Text": "Cryptobex, 13 yaş ve üzeri kullanıcılar için tasarlanmıştır. 13 yaş altındaki çocuklardan bilerek kişisel bilgi toplamamaktayız. Eğer bir çocuktan yanlışlıkla kişisel veri topladığımızı düşünüyorsanız, lütfen verilerin kaldırılması için hemen bizimle iletişime geçin.",
      "section7Title": "7. Haklarınız",
      "section7Text": "Aşağıdaki haklara sahipsiniz:",
      "section7ListItem1": "Cryptobex tarafından tutulan kişisel verilerinize erişim.",
      "section7ListItem2": "Yanlış veya güncelliğini yitirmiş bilgilerin düzeltilmesi veya güncellenmesini talep etme.",
      "section7ListItem3": "Yasal veya operasyonel saklama gereksinimlerine tabi olarak, kişisel verilerinizin silinmesini veya anonimleştirilmesini talep etme.",
      "section7ListItem4": "Uygun olduğu durumlarda, verilerinizin işlenmesine itiraz etme.",
      "section8Title": "8. Üçüncü Taraf Hizmetler",
      "section8Text": "Cryptobex, kullanıcı doğrulaması için Google OAuth kullanır ve analiz ile performans izlemesi için üçüncü taraf araçları entegre edebilir. Bu hizmetler, kendi gizlilik politikalarına göre çalışmaktadır; bu politikaları incelemenizi öneririz.",
      "section9Title": "9. Bu Gizlilik Politikasındaki Değişiklikler",
      "section9Text": "Bu Gizlilik Politikasını herhangi bir zamanda güncelleme hakkımız saklıdır. Yapılan değişiklikler, uygulamada ve web sitemizde güncellenmiş politikanın yayınlanması ile derhal yürürlüğe girer. Bu politikayı periyodik olarak incelemenizi öneririz.",
      "section10Title": "10. Bize Ulaşın",
      "section10Text": "Bu Gizlilik Politikası ile ilgili herhangi bir sorunuz veya endişeniz varsa, lütfen bizimle iletişime geçin:",
      "section10ListItem1": "<1>E-posta:</1> hckapplications@gmail.com",
      "section10ListItem2": "<1>Adres:</1> Ataşehir, Istanbul, Turkey",
      "finalText": "Cryptobex'u kullanarak, bu Gizlilik Politikasını okuduğunuzu ve anladığınızı kabul etmiş olursunuz."
    }
  }
  