{
    "privacyPolicy": {
      "title": "Gizlilik Politikası",
      "effectiveDate": "Yürürlük Tarihi: 19 Kasım 2024",
      "intro": "Biz, <1>HASANCAN ÇAKICIOĞLU HCK</1> (\"biz,\" \"bizim,\" \"bize\"), gizliliğinizi korumaya ve verilerinizi nasıl işlediğimiz konusunda şeffaflık sağlamaya adadık. Bu Gizlilik Politikası, VoidNote (\"Uygulama\") kullanırken sağladığınız bilgilerin nasıl toplandığını, kullanıldığını ve korunduğunu açıklamaktadır. VoidNote'u kullanarak, bu politikada belirtilen şartları kabul etmiş olursunuz.",
      "section1Title": "1. Giriş",
      "section1Text": "VoidNote, her yaştan kullanıcıya hitap eden, basit ama güçlü bir not alma uygulamasıdır. Uygulamamız, kullanıcıların notlarını cihazlarında yerel olarak veya Google Drive gibi harici depolama hizmetlerine yedeklemelerine olanak tanır.",
      "section2Title": "2. Topladığımız Bilgiler",
      "section2Text": "VoidNote, sadelik ve minimum veri toplama prensibi göz önünde bulundurularak tasarlanmıştır. Ancak, bazı özellikler belirli türde bilgilerin toplanmasını gerektirebilir:",
      "section2_1Title": "2.1 Kişisel Bilgiler",
      "section2_1Item1": "<1>Google Drive Entegrasyonu:</1> Kullanıcılar notlarını Google Drive'a yedeklemeyi seçtiğinde, VoidNote, Google hesabınızdan e-posta adresiniz ve benzersiz kullanıcı kimliği gibi sınırlı bilgileri toplayabilir.",
      "section2_1Item2": "<1>Kullanım Verileri:</1> Uygulama tercihleri ve özellik kullanımına ilişkin bilgiler, kullanıcı deneyimini geliştirmek amacıyla toplanabilir.",
      "section2_2Title": "2.2 Kişisel Olmayan Bilgiler",
      "section2_2Item1": "İşletim sistemi, uygulama sürümü ve genel performans metrikleri gibi cihaz bilgileri.",
      "section2_2Text": "Uygulamanın işlevselliği dışında hassas bilgiler toplamıyor veya kullanıcı etkinliklerini izlemiyoruz.",
      "section3Title": "3. Bilgilerinizi Nasıl Kullanıyoruz",
      "section3Text": "Verilerinizi aşağıdaki amaçlarla toplar ve işleriz:",
      "section3Item1": "Notlarınızı cihazınızda yerel olarak veya Google Drive'a yedeklemenizi sağlamak.",
      "section3Item2": "Uygulama işlevselliğini ve kullanıcı deneyimini geliştirmek.",
      "section3Item3": "Sorunları gidermek ve uygulama performansını artırmak.",
      "section3Text2": "Sadece uygulamanın çalışması için gerekli olan verileri toplar ve kullanırız.",
      "section4Title": "4. Google Drive Entegrasyonu",
      "section4Text": "VoidNote, kullanıcıların notlarını yedeklemeleri ve geri yüklemeleri için Google Drive ile entegre çalışır. Google hesabınızı bağladığınızda:",
      "section4Item1": "<1>Veri Depolama:</1> Sadece VoidNote içinde oluşturulan notlar, Google Drive'ınızda depolanır.",
      "section4Item2": "<1>Erişim Yetkileri:</1> Uygulama, sadece VoidNote'a özgü dosyaları oluşturmak, almak ve yönetmek için minimum izinler talep eder.",
      "section4Item3": "<1>Veri Kullanımı:</1> Google Drive'ınızdaki diğer dosyalara erişmez veya bunları paylaşmayız.",
      "section4Text2": "Google'ın veri politikaları hakkında daha fazla bilgi için lütfen Google Gizlilik Politikasına bakın.",
      "section5Title": "5. Veri Güvenliği",
      "section5Text": "Veri güvenliğinize öncelik veriyoruz ve sektör standartlarında uygulamaları hayata geçiriyoruz, bunlar arasında:",
      "section5Item1": "Şifreleme: Harici depolama (örneğin, Google Drive) ile gönderilen ve alınan tüm veriler, güvenli protokoller kullanılarak şifrelenir.",
      "section5Item2": "Yerel Depolama: Cihazınızda yerel olarak kaydedilen notlar güvenli bir şekilde depolanır.",
      "section5Item3": "Sınırlı Erişim: Kullanıcı verilerine yalnızca yetkili personel, sadece sorun giderme veya uyum amaçlı erişim sağlar.",
      "section5Text2": "Bu önlemlere rağmen, hiçbir sistem tamamen güvenli değildir. Kullanıcıların güçlü şifreler kullanmasını ve cihazlarının güvenli olmasını öneririz.",
      "section6Title": "6. Veri Paylaşımı",
      "section6Text": "VoidNote, kişisel bilgilerinizi satmaz, takas etmez veya kiralamaz. Veriler, yalnızca aşağıdaki durumlarda paylaşılabilir:",
      "section6Item1": "Sizin Onayınızla: Açıkça izin verdiğiniz durumlarda.",
      "section6Item2": "Yasal Yükümlülükler: İlgili yasa, düzenleme veya hukuki süreçlere uymak gerektiğinde.",
      "section7Title": "7. Çocukların Gizliliği",
      "section7Text": "VoidNote, her yaştan kullanıcı için uygundur. Ancak, 13 yaşın altındaki çocuklardan bilerek kişisel bilgi toplamıyoruz. Çocuğunuzun kişisel veri sağladığını düşünüyorsanız, lütfen verilerin silinmesi için bizimle iletişime geçin.",
      "section8Title": "8. Haklarınız",
      "section8Text": "Verilerinizle ilgili aşağıdaki haklara sahipsiniz:",
      "section8Item1": "Erişim: Hakkınızda tuttuğumuz kişisel verilerin bir kopyasını talep edebilirsiniz.",
      "section8Item2": "Silme veya Bağlantıyı Kesme: Hesabınızı silebilir veya Google Drive bağlantısını istediğiniz zaman kesebilirsiniz.",
      "section8Item3": "Düzeltmeler: Yanlış veya eksik veriler için düzeltme talep edebilirsiniz.",
      "section8Text2": "Bu hakları kullanmak için, aşağıda verilen e-posta adresinden bizimle iletişime geçin.",
      "section9Title": "9. Üçüncü Taraf Hizmetler",
      "section9Text": "VoidNote, Google Drive ile entegre çalışır ve analiz ile hata raporlaması için diğer üçüncü taraf araçlarına da dayanabilir. Bu hizmetler bağımsız olarak çalışır ve uyguladıkları politikalar kendi gizlilik politikalarına tabidir.",
      "section10Title": "10. Bu Gizlilik Politikasındaki Değişiklikler",
      "section10Text": "Bu Gizlilik Politikasını herhangi bir zamanda güncelleme veya değiştirme hakkını saklı tutarız. Yapılan değişiklikler, uygulamada veya web sitemizde yayınlandığı anda yürürlüğe girer. Bilgilerinizin nasıl korunduğu konusunda bilgi sahibi olmanız için bu politikayı periyodik olarak gözden geçirmenizi öneririz.",
      "section11Title": "11. Bize Ulaşın",
      "section11Text": "Bu Gizlilik Politikası ile ilgili herhangi bir soru veya endişeniz varsa, lütfen aşağıdaki adres üzerinden bizimle iletişime geçin:",
      "section11Item1": "<1>Şirket Adı:</1> HASANCAN ÇAKICIOĞLU HCK",
      "section11Item2": "<1>E-posta:</1> hckapplications@gmail.com",
      "section11Item3": "<1>Adres:</1> Ataşehir, İstanbul, Türkiye",
      "section11Text2": "VoidNote'u kullanarak, bu Gizlilik Politikasını okuduğunuzu ve anladığınızı kabul etmiş olursunuz."
    }
  }
  