{
    "photoTranslator": {
      "title": "Photo Translator Gizlilik Politikası",
      "effectiveDateLabel": "Yürürlük Tarihi: ",
      "effectiveDate": "1 Nisan 2025",
      "section1Title": "1. Giriş",
      "section1Text": "Photo Translator (\"Uygulama\", \"biz\", \"bize\" veya \"bizim\") olarak gizliliğinize değer veriyoruz. Bu Gizlilik Politikası, Photo Translator mobil uygulamasını kullandığınızda bilgilerinizi nasıl işlediğimizi açıklamaktadır. Uygulamamız, cihazınızın kamerasını veya galerisini kullanarak seçtiğiniz fotoğraflardaki metinleri tanımanıza ve çevirmenize olanak tanır.",
      "importantNoteLabel": "Önemli Not: ",
      "importantNote": "Photo Translator, kullanıcılarına ait kişisel olarak tanımlanabilir hiçbir bilgiyi toplamaz, saklamaz veya internet üzerinden herhangi bir sunucuya göndermez. Tüm işlemler (metin tanıma, çeviri vb.) cihazınız üzerinde yerel olarak gerçekleştirilir.",
      "section2Title": "2. Topladığımız Bilgiler (Daha Doğrusu Toplamadıklarımız)",
      "section2Text1": "Uygulamanın temel işlevlerini yerine getirebilmesi için bazı izinlere ve erişimlere ihtiyacı vardır, ancak bu erişimler kişisel veri toplama amacı taşımaz:",
      "section2ListItem1": "<0>Kamera Erişimi:</0> Yalnızca fotoğraf çekerek metin tanıma ve çeviri işlemi yapmak istemeniz durumunda, sizin onayınızla kameranıza erişilir. Çekilen fotoğraf hiçbir sunucuya gönderilmez, işlem yalnızca cihazınızda yapılır.",
      "section2ListItem2": "<0>Galeri/Fotoğraf Arşivi Erişimi:</0> Yalnızca galerinizden metin tanıma ve çeviri işlemi için bir fotoğraf seçmek istemeniz durumunda, sizin onayınızla galerinize erişilir. Seçilen fotoğraf hiçbir sunucuya gönderilmez, işlem yalnızca cihazınızda yapılır.",
      "section2ListItem3": "<0>ML Kit Modelleri:</0> Uygulama, metin tanıma ve çeviri gibi işlevleri sağlamak için Google tarafından geliştirilen ML Kit teknolojisini kullanır. Bu teknoloji, ilgili dil modellerinin cihazınıza indirilmesini gerektirebilir. Bu indirme işlemi Google'ın sunucuları üzerinden gerçekleşebilir ancak bu süreçte sizin kişisel verileriniz veya işlediğiniz fotoğraflar/metinler Google ile paylaşılmaz. İndirilen modeller cihazınızda saklanır ve çevrimdışı çalışmaya olanak tanır.",
      "section2Text2": "Tekrar belirtmek isteriz ki, adınız, e-posta adresiniz, konumunuz, IP adresiniz, cihaz kimliğiniz veya kullanım alışkanlıklarınız gibi kişisel olarak sizi tanımlayabilecek hiçbir veriyi toplamıyoruz veya saklamıyoruz.",
      "section3Title": "3. Bilgilerinizi Nasıl Kullanıyoruz",
      "section3Text": "Uygulama, erişim izinlerini ve ML Kit modellerini yalnızca aşağıdaki amaçlar için kullanır:",
      "section3ListItem1": "Seçtiğiniz veya çektiğiniz fotoğraftaki metinleri cihazınız üzerinde tanımak.",
      "section3ListItem2": "Tanınan metni, yine cihazınız üzerinde, seçtiğiniz hedef dile çevirmek.",
      "section3ListItem3": "Uygulamanın temel özelliklerini (fotoğraf seçme, metin gösterme vb.) sunmak.",
      "processingNoteLabel": "İşlem Notu: ",
      "processingNote": "İşlenen fotoğraflar ve metinler yalnızca geçici olarak cihazınızın belleğinde tutulur ve işlem tamamlandıktan sonra saklanmaz veya herhangi bir yere gönderilmez.",
      "section4Title": "4. Veri Güvenliği",
      "section4Text": "Kullanıcı verilerini toplamıyor olsak da, uygulamanın kendisinin ve kullandığı teknolojilerin (ML Kit gibi) güvenliğine önem veriyoruz. Tüm işlemler cihazınızda yerel olarak yapıldığı için, verilerinizin internet üzerinden yetkisiz erişime uğrama riski bulunmamaktadır. İndirilen ML Kit modelleri, işletim sisteminin sağladığı güvenlik mekanizmaları dahilinde korunur.",
      "section5Title": "5. Çocukların Gizliliği",
      "section5Text": "Uygulamamız genel kitleye yöneliktir ve bilerek 13 yaş altı çocuklardan (veya ilgili yargı bölgesindeki eşdeğer minimum yaştan) kişisel bilgi toplamaz. Uygulama doğası gereği kişisel veri toplamadığından, çocukların gizliliği konusunda ek bir risk oluşturmaz.",
      "section6Title": "6. Üçüncü Taraf Hizmetler",
      "section6Text": "Uygulamamız, temel işlevselliği sağlamak için Google ML Kit gibi üçüncü taraf teknolojilerini kullanır. ML Kit modellerinin indirilmesi Google'ın hizmet şartlarına tabi olabilir. Bunun dışında, veri paylaşımı yaptığımız başka bir üçüncü taraf hizmeti bulunmamaktadır.",
      "section7Title": "7. Bu Gizlilik Politikasındaki Değişiklikler",
      "section7Text": "Bu Gizlilik Politikasını zaman zaman güncelleyebiliriz. Politikada önemli değişiklikler yapıldığında, güncellenmiş politikayı uygulama içinde veya ilgili uygulama mağazası sayfasında yayınlayarak sizi bilgilendireceğiz. Politikayı periyodik olarak gözden geçirmenizi öneririz.",
      "section8Title": "8. Bize Ulaşın",
      "section8Text": "Bu Gizlilik Politikası ile ilgili herhangi bir sorunuz veya endişeniz varsa, lütfen bizimle iletişime geçmekten çekinmeyin:",
      "contactEmail": "hckapplications@gmail.com", 
      "section8ListItem1": "<0>E-posta:</0> <1>{{contactEmail}}</1>",
      "finalText": "Photo Translator'ı kullanarak, bu Gizlilik Politikasını okuduğunuzu ve anladığınızı kabul etmiş olursunuz."
    }
  }