{
  "weeChess": {
    "contactEmail": "hckapplications@gmail.com",
    "title": "WeeChess Gizlilik Politikası",
    "effectiveDateLabel": "Yürürlük Tarihi: ",
    "effectiveDate": "2 Şubat 2026",
    "section1Title": "1. Giriş",
    "section1Text": "WeeChess, satranç puzzle'ı çözdüren bir mobil oyun uygulamasıdır. Bu gizlilik politikası, uygulamanın veri işleme sürecini ve kullanılan üçüncü taraf hizmetleri açıklar. Uygulamamızı kullanarak bu politikayı kabul etmiş sayılırsınız.",
    "section2Title": "2. Uygulama Tarafından İşlenen Veriler",
    "section2Text": "WeeChess, kullanıcıya ait kişisel verileri doğrudan toplamaz veya kendi veritabanında saklamaz. Ancak uygulama işlevselliği kapsamında Apple Game Center, Google Play Games, Google AdMob ve GlitchTip (hata takibi) gibi üçüncü taraf hizmetler kullanılmaktadır. Bu hizmetler, kendi gizlilik politikaları doğrultusunda bazı kullanıcı verilerini işleyebilir.",
    "section2_2Title": "2.1 Puzzle Beğeni / Beğenmeme (Like / Dislike)",
    "section2_2Text": "Uygulamada puzzle'lara like ve dislike verilebilmektedir. Uygulama içinde sadece her puzzle için toplam like ve dislike sayıları tutulur. Hangi kullanıcının hangi puzzle'a like veya dislike verdiği bilgisi hiçbir şekilde saklanmaz ve bu veriler kişisel bir kimlik bilgisiyle eşleştirilmez.",
    "section3Title": "3. Üçüncü Taraf Hizmetler (Google ve Apple)",
    "section3Text": "Uygulama içinde reklam, uygulama içi satın alma, skor ve leaderboard gibi özellikler için Google ve Apple'ın resmi hizmetleri kullanılmaktadır. Bu kapsamda veri işleme, ilgili üçüncü taraf servisler tarafından kendi gizlilik politikalarına uygun şekilde gerçekleştirilir.",
    "section3_1Title": "3.1 Google AdMob (Reklamlar)",
    "section3_1Text": "Reklamlar Google AdMob üzerinden gösterilir. Reklam tanımlayıcıları ve benzeri veriler, reklamların gösterilmesi ve ölçülmesi amacıyla Google tarafından işlenebilir. Detaylar için Google gizlilik politikasına bakabilirsiniz:",
    "section3_1Link": "https://policies.google.com/privacy",
    "section3_1LinkText": "Google gizlilik politikası",
    "section3_2Title": "3.2 Uygulama İçi Satın Alma (Apple ve Google)",
    "section3_2Text": "Elmas gibi uygulama içi satın almalar, Apple App Store ve Google Play Store'un resmi ödeme sistemleri üzerinden gerçekleştirilir. Ödeme ve fatura bilgileri tamamen Apple veya Google tarafından işlenir; geliştirici olarak bana kredi kartı, fatura veya kimlik bilgileri iletilmez. Satın alma bilgileri, bu platformların kendi sistemleri üzerinden geri yüklenebilir ve geliştirici tarafından ayrı bir sunucuda saklanmaz.",
    "section3_3Title": "3.3 Game Center ve Google Play Games (Skor ve Leaderboard)",
    "section3_3Text": "Oyun ilerlemesi, skorlar ve leaderboard verileri, oyuncuların sıralamada yer alabilmesi ve ilerlemelerinin cihazlar arasında korunabilmesi için Apple Game Center ve Google Play Games tarafından işlenir. Bu veriler Apple/Google hesaplarınızla ilişkilendirilir ve uygulama geliştiricisi tarafından ayrı bir veritabanında saklanmaz; yönetim ve saklama ilgili platformlar tarafından yapılır.",
    "section3_3Important": "ÖNEMLİ: Satın almalarınızın ve ilerlemenizin cihazlar arası taşınması için ayarlardan Game Center (iOS) veya Google Play Games (Android) girişinin açık olması gerekir. Aksi halde satın almalar ve kayıt sadece o cihazda kalır, cihaz değişince veya uygulama silinince kaybolabilir.",
    "section3_4Title": "3.4 GlitchTip (Hata Takibi ve Crash Raporları)",
    "section3_4Text": "Uygulamanın kararlılığını artırmak ve hataları tespit etmek için GlitchTip hata takibi servisi kullanılmaktadır. GlitchTip, uygulama çökmesi ve hata durumlarında cihaz bilgileri (cihaz modeli, işletim sistemi versiyonu), hata mesajları, stack trace'ler ve benzeri teknik verileri toplayabilir. Bu veriler yalnızca uygulama performansını iyileştirmek ve hataları düzeltmek amacıyla kullanılır.",
    "section4Title": "4. Veri Kullanımı",
    "section4Text": "WeeChess, kullanıcıya ait kişisel verileri doğrudan işlemez veya profil oluşturmaz. Uygulamanın çalışması için gerekli olan reklam, satın alma, oyun ilerleme ve hata takibi verileri yalnızca ilgili üçüncü taraf hizmetler (Apple, Google ve GlitchTip) tarafından, kendi gizlilik politikalarına uygun şekilde işlenir. Like/dislike verileri ise yalnızca puzzle bazında anonim toplamlar olarak kullanılır.",
    "section5Title": "5. Veri Paylaşımı",
    "section5Text": "WeeChess, kullanıcıya ait kişisel verileri kendi adına üçüncü taraflarla paylaşmaz. Reklam, satın alma, skor, leaderboard ve hata takibi verilerine ilişkin işleme faaliyetleri, doğrudan Google, Apple ve GlitchTip hizmetleri kapsamında yürütülür ve bu şirketlerin gizlilik politikalarına tabidir.",
    "section6Title": "6. Veri Güvenliği",
    "section6Text": "WeeChess, kullanıcıya ait kişisel verileri kendi veritabanında saklamaz. Like/dislike toplam sayıları anonim şekilde tutulur ve belirli bir kullanıcıyla eşleştirilemez. Üçüncü taraf hizmetler (Game Center, Google Play Games, AdMob, GlitchTip) ise kendi güvenlik önlemleri ve standartları çerçevesinde veri güvenliğini sağlar.",
    "section8Title": "7. Haklarınız ve Tercihler",
    "section8Text": "Reklam, oyun verileri ve satın alma işlemlerine ilişkin pek çok tercihinizi Apple ve Google hesap ayarlarınız üzerinden yönetebilirsiniz.",
    "section8Item1": "Reklam kişiselleştirmesini cihaz ve Google ayarlarından kapatabilirsiniz.",
    "section8Item2": "Satın alma ve iade işlemlerini App Store / Play Store üzerinden yönetebilirsiniz.",
    "section9Title": "8. Çerezler ve Takip",
    "section9Text": "Reklamlar Google AdMob üzerinden sunulduğu için, reklam çerezleri ve benzeri takip uygulamaları Google tarafından yönetilir. Çerez ve reklam tercihlerinizi Google hesabı ve cihaz ayarları üzerinden değiştirebilirsiniz.",
    "section11Title": "9. Politika Değişiklikleri",
    "section11Text": "Bu gizlilik politikasını gerektiğinde güncelleme hakkım saklıdır. Güncellemeler uygulama veya web sitesinde yayınlandığı anda yürürlüğe girer. Önemli değişikliklerde uygulama içi bilgilendirme yapılabilir.",
    "section12Title": "10. İletişim",
    "section12Text": "Bu gizlilik politikası hakkında sorularınız için:",
    "section12ListItem1": "<0>E-posta:</0> <1>{{contactEmail}}</1>",
    "finalText": "WeeChess'i kullanarak bu gizlilik politikasını okuduğunuzu ve kabul ettiğinizi varsayıyoruz. İyi oyunlar!"
  }
}
