{
  "weeChess": {
    "contactEmail": "hckapplications@gmail.com",
    "title": "WeeChess Privacy Policy",
    "effectiveDateLabel": "Effective Date: ",
    "effectiveDate": "February 2, 2026",
    "section1Title": "1. Introduction",
    "section1Text": "WeeChess is a mobile chess puzzle game. This privacy policy explains how the app processes data and which third-party services are used. By using the app, you accept this policy.",
    "section2Title": "2. Data Processed by the App",
    "section2Text": "WeeChess does not directly collect or store personal data about you in its own database. However, to provide core functionality, the app integrates with third-party services such as Apple Game Center, Google Play Games, Google AdMob, and GlitchTip (error tracking). These services may process certain user data under their own privacy policies.",
    "section2_2Title": "2.1 Puzzle Like / Dislike",
    "section2_2Text": "The app lets you like or dislike puzzles. Only the total like and dislike count per puzzle is stored. Information about which user gave which like or dislike is never stored, and these counts are not linked to any personal identifier.",
    "section3Title": "3. Third-Party Services (Google and Apple)",
    "section3Text": "For ads, in-app purchases, scores, and leaderboards, WeeChess uses official services provided by Google and Apple. In this context, data processing is carried out by these third-party services in accordance with their own privacy policies.",
    "section3_1Title": "3.1 Google AdMob (Ads)",
    "section3_1Text": "Ads are shown via Google AdMob. Ad identifiers and similar data may be processed by Google in order to deliver and measure ads. For details, see Google’s privacy policy:",
    "section3_1Link": "https://policies.google.com/privacy",
    "section3_1LinkText": "Google privacy policy",
    "section3_2Title": "3.2 In-App Purchases (Apple and Google)",
    "section3_2Text": "In-app purchases (such as diamonds) are processed through the official payment systems of the Apple App Store and Google Play Store. Payment and billing information is handled entirely by Apple or Google; as the developer, I do not receive your credit card, billing, or identity details. Purchase information can be restored through these platforms’ own systems and is not stored on a separate developer server.",
    "section3_3Title": "3.3 Game Center and Google Play Games (Scores and Leaderboards)",
    "section3_3Text": "Game progress, scores, and leaderboard data are processed by Apple Game Center and Google Play Games so that players can appear on leaderboards and keep their progress across devices. This data is associated with your Apple/Google account and is not stored in a separate database by the developer; storage and management are handled by the respective platforms.",
    "section3_3Important": "IMPORTANT: To sync your purchases and progress across devices, you must be signed in to Game Center (iOS) or Google Play Games (Android) in your settings. Otherwise, purchases and progress remain only on that device and may be lost if you change devices or reinstall the app.",
    "section3_4Title": "3.4 GlitchTip (Error Tracking and Crash Reports)",
    "section3_4Text": "To improve app stability and detect errors, WeeChess uses GlitchTip, an error tracking service. GlitchTip may collect device information (device model, operating system version), error messages, stack traces, and similar technical data when the app crashes or encounters errors. This data is used solely to improve app performance and fix bugs.",
    "section4Title": "4. How Data Is Used",
    "section4Text": "WeeChess does not directly process personal data to build profiles or track individuals. Any data required for ads, purchases, game progress, and error tracking is processed only by the relevant third-party services (Apple, Google, and GlitchTip) under their own privacy policies. Like/dislike data is used only as anonymous per-puzzle totals.",
    "section5Title": "5. Data Sharing",
    "section5Text": "WeeChess does not share personal data on its own behalf with third parties. Any processing related to ads, purchases, scores, leaderboards, and error tracking is carried out directly within Google, Apple, and GlitchTip services and is subject to their privacy policies.",
    "section6Title": "6. Data Security",
    "section6Text": "WeeChess does not maintain its own database of personal user data. Like/dislike totals are stored anonymously and cannot be linked to specific users. Third-party services (Game Center, Google Play Games, AdMob, GlitchTip) apply their own security measures and standards to protect data they process.",
    "section8Title": "7. Your Rights and Choices",
    "section8Text": "You can control many of your ad, game data, and purchase-related preferences through your Apple and Google account settings.",
    "section8Item1": "You can disable ad personalization in your device and Google settings.",
    "section8Item2": "You can manage purchases and refunds through the App Store or Play Store.",
    "section9Title": "8. Cookies and Tracking",
    "section9Text": "Ads are delivered by Google AdMob, so any ad-related cookies and similar tracking technologies are managed by Google. You can adjust your cookie and ad preferences in your Google account and device settings.",
    "section11Title": "9. Policy Changes",
    "section11Text": "I may update this privacy policy when necessary. Updates take effect once published in the app or on the website. For significant changes, I may provide in-app notifications.",
    "section12Title": "10. Contact",
    "section12Text": "For questions about this privacy policy:",
    "section12ListItem1": "<0>Email:</0> <1>{{contactEmail}}</1>",
    "finalText": "By using WeeChess, you are deemed to have read and accepted this privacy policy. Enjoy the game!"
  }
}
