{
    "privacyPolicy": {
      "title": "Privacy Policy",
      "effectiveDate": "Effective Date: November 19, 2024",
      "intro": "At <1>HASANCAN ÇAKICIOĞLU HCK</1> (\"we,\" \"our,\" \"us\"), we are dedicated to protecting your privacy and ensuring transparency in how we handle your data. This Privacy Policy explains how we collect, use, and protect the information you provide while using VoidNote (\"App\"). By using VoidNote, you agree to the terms outlined in this policy.",
      "section1Title": "1. Introduction",
      "section1Text": "VoidNote is a simple yet powerful note-taking application designed for users of all ages. Our app allows users to create, organize, and back up their notes locally on their devices or to external storage services like Google Drive.",
      "section2Title": "2. Information We Collect",
      "section2Text": "VoidNote is designed with simplicity and minimal data collection in mind. However, certain features may require the collection of specific types of information:",
      "section2_1Title": "2.1 Personal Information",
      "section2_1Item1": "<1>Google Drive Integration:</1> When users choose to back up their notes to Google Drive, VoidNote may collect limited information from your Google account, such as your email address and unique user ID.",
      "section2_1Item2": "<1>Usage Data:</1> Information such as app preferences and feature usage may be collected to improve user experience.",
      "section2_2Title": "2.2 Non-Personal Information",
      "section2_2Item1": "Device information such as operating system, app version, and general performance metrics.",
      "section2_2Text": "We do not collect sensitive information or track user activity beyond the scope of the App's functionality.",
      "section3Title": "3. How We Use Your Information",
      "section3Text": "We collect and process your data for the following purposes:",
      "section3Item1": "To enable you to save and back up your notes locally or to Google Drive.",
      "section3Item2": "To enhance app functionality and user experience.",
      "section3Item3": "To troubleshoot issues and improve app performance.",
      "section3Text2": "We only collect and use data necessary for the app’s operation.",
      "section4Title": "4. Google Drive Integration",
      "section4Text": "VoidNote integrates with Google Drive to allow users to back up and restore notes. When you connect your Google account:",
      "section4Item1": "<1>Data Storage:</1> Only notes created within VoidNote are stored on your Google Drive.",
      "section4Item2": "<1>Access Scope:</1> The App requests minimal permissions to create, retrieve, and manage files specific to VoidNote.",
      "section4Item3": "<1>Data Usage:</1> We do not access or share other files on your Google Drive.",
      "section4Text2": "For more details on Google’s data policies, please refer to the Google Privacy Policy.",
      "section5Title": "5. Data Security",
      "section5Text": "We prioritize your data security by implementing industry-standard practices, including:",
      "section5Item1": "Encryption: All data transmitted to and from external storage (e.g., Google Drive) is encrypted using secure protocols.",
      "section5Item2": "Local Storage: Notes saved locally are stored securely on your device.",
      "section5Item3": "Limited Access: Only authorized personnel have access to user data, and solely for troubleshooting or compliance purposes.",
      "section5Text2": "Despite these measures, no system is entirely secure. We encourage users to use strong passwords and ensure their devices are secure.",
      "section6Title": "6. Data Sharing",
      "section6Text": "VoidNote does not sell, trade, or rent your personal information. Data may only be shared under the following circumstances:",
      "section6Item1": "With Your Consent: When explicitly authorized by you.",
      "section6Item2": "Legal Obligations: If required to comply with applicable laws, regulations, or legal processes.",
      "section7Title": "7. Children’s Privacy",
      "section7Text": "VoidNote is suitable for users of all ages. However, we do not knowingly collect personal information from children under the age of 13. If you believe your child has provided personal data, please contact us to have it deleted.",
      "section8Title": "8. Your Rights",
      "section8Text": "You have the following rights concerning your data:",
      "section8Item1": "Access: You can request a copy of the personal data we hold about you.",
      "section8Item2": "Delete or Disconnect: You can delete your account or disconnect Google Drive at any time.",
      "section8Item3": "Corrections: You can request corrections to inaccurate or incomplete data.",
      "section8Text2": "To exercise these rights, contact us at the email provided below.",
      "section9Title": "9. Third-Party Services",
      "section9Text": "VoidNote integrates with Google Drive and may rely on other third-party tools for analytics and crash reporting. These services operate independently, and their practices are governed by their respective privacy policies.",
      "section10Title": "10. Changes to This Privacy Policy",
      "section10Text": "We reserve the right to update or modify this Privacy Policy at any time. Changes will be effective immediately upon posting in the app or on our website. We encourage you to review this policy periodically to stay informed about how we protect your information.",
      "section11Title": "11. Contact Us",
      "section11Text": "If you have any questions or concerns regarding this Privacy Policy, please contact us at:",
      "section11Item1": "<1>Company Name:</1> HASANCAN ÇAKICIOĞLU HCK",
      "section11Item2": "<1>Email:</1> hckapplications@gmail.com",
      "section11Item3": "<1>Address:</1> Ataşehir, İstanbul, Turkey",
      "section11Text2": "By using VoidNote, you acknowledge that you have read and understood this Privacy Policy."
    }
  }
  