{
    "cryptobex": {
      "title": "Cryptobex Privacy Policy",
      "effectiveDate": "Effective Date: 7.02.2025",
      "section1Title": "1. Introduction",
      "section1Text": "Cryptobex is a strategic simulation game application that allows users to experiment with virtual currency and develop game strategies in a risk‐free environment. Users sign in using their Google OAuth credentials, after which a JWT token is created to manage sessions securely.",
      "section2Title": "2. Information We Collect",
      "section2Text": "Cryptobex collects the following data:",
      "section2ListItem1": "<1>Authentication Data:</1> Information provided via Google OAuth, including your Gmail address, name, and profile details. After authentication, a JWT token is generated for session management.",
      "section2ListItem2": "<1>Usage Data:</1> Technical details such as device type, IP address, browser information, interaction logs, and in-game actions.",
      "section3Title": "3. How We Use Your Information",
      "section3Text": "We use your data to:",
      "section3ListItem1": "Authenticate and secure your account via Google OAuth and manage your session with JWT tokens.",
      "section3ListItem2": "Personalize and enhance your gaming experience by tailoring strategies and recommendations based on your interactions.",
      "section3ListItem3": "Improve application performance, diagnose issues, and develop new features.",
      "section4Title": "4. Google OAuth and JWT",
      "section4Text": "We utilize Google OAuth to provide a secure, one-click sign-in experience. Upon successful authentication, a JWT token is generated and securely stored. All token-related communications occur over encrypted channels.",
      "section5Title": "5. Data Security",
      "section5Text": "Your data is transmitted using HTTPS to ensure encryption in transit. All personal information, including Gmail addresses and names, is stored securely in our encrypted databases. Access to your data is strictly controlled and limited to authorized personnel only.",
      "section6Title": "6. Children's Privacy",
      "section6Text": "Cryptobex is designed for users aged 13 and older. We do not knowingly collect personal information from children under the age of 13. If you believe that we have inadvertently collected personal data from a child, please contact us immediately so that we can remove the data.",
      "section7Title": "7. Your Rights",
      "section7Text": "You have the right to:",
      "section7ListItem1": "Access your personal data held by Cryptobex.",
      "section7ListItem2": "Request corrections or updates to any inaccurate or outdated information.",
      "section7ListItem3": "Request deletion or anonymization of your personal data, subject to legal or operational retention requirements.",
      "section7ListItem4": "Object to the processing of your data where applicable.",
      "section8Title": "8. Third-Party Services",
      "section8Text": "Cryptobex uses Google OAuth for user authentication and may incorporate third-party tools for analytics and performance monitoring. These services operate under their respective privacy policies, which you are encouraged to review.",
      "section9Title": "9. Changes to This Privacy Policy",
      "section9Text": "We reserve the right to update this Privacy Policy at any time. Any changes will be effective immediately upon posting the updated policy within the application and on our website. We recommend that you review this policy periodically for any updates.",
      "section10Title": "10. Contact Us",
      "section10Text": "If you have any questions or concerns regarding this Privacy Policy, please contact us at:",
      "section10ListItem1": "<1>Email:</1> hckapplications@gmail.com",
      "section10ListItem2": "<1>Address:</1> Ataşehir, Istanbul, Turkey",
      "finalText": "By using Cryptobex, you acknowledge that you have read and understood this Privacy Policy."
    }
  }
  